#include "INTx.h" //中断函数头文件

//********************************WMH 2022.12.17

//外部中断0
//********************************
void INT0_Init(void)//外部中断0初始化函数
{
    IT0 = 0;        //1.如果IT0 = 0 ;使能INT0上升沿和下降沿中断
										//2.如果IT0 = 1;使能INT0下降沿才能中断
	
    EX0 = 1;        //使能INT0中断
    EA = 1;         //打开总中断
}

void INT0_Isr() interrupt 0     //外部中断0中断服务函数
{
	//中断程序写下面
	P00=~P00;
}


//********************************
//外部中断1
//********************************
void INT1_Init(void)//外部中断1初始化函数
{
    IT1 = 0;        //如果IT1 = 0 ;使能INT1上升沿和下降沿中断
										//如果IT1 = 1;使能INT1下降沿才能中断
	
    EX1 = 1;        //使能INT1中断
    EA = 1;         //打开总中断
}

void INT1_Isr() interrupt 2     //外部中断1中断服务函数
{
	//中断程序写下面
	P01=~P01;

}



//********************************
//外部中断2
//********************************
void INT2_Init(void)//外部中断2初始化函数
{
    INT_CLKO |= EX2;  //使能INT2中断(INT2,INT3,INT4只能下降沿触发)                          
    EA = 1;         //打开总中断
}

void INT2_Isr() interrupt 10
{
	//中断程序写下面
	P02=~P02;
}


//********************************
//外部中断3
//********************************
void INT3_Init(void)//外部中断3初始化函数
{
    INT_CLKO |= EX3;  //使能INT3中断(INT2,INT3,INT4只能下降沿触发)                          
    EA = 1;         //打开总中断
}

void INT3_Isr() interrupt 11
{
	//中断程序写下面
	P03=~P03;
	
}


//********************************
//外部中断4
//********************************
void INT4_Init(void)//外部中断4初始化函数
{
    INT_CLKO |= EX4;  //使能INT4中断(INT2,INT3,INT4只能下降沿触发)                          
    EA = 1;         //打开总中断
}

void INT4_Isr() interrupt 16
{
	//中断程序写下面
	P04=~P04;
	
}